Repository: A-M-CODING/BYTE
Catalog: lib/l10n/app_*.arb
Languages: ur

# loginTitle
source: Login
ur: لاگ ان کریں

source: Login to your account
ur: اپنے اکاؤنٹ میں لاگ ان کریں

source: Email
ur: ایمیل

source: Password
ur: پاس ورڈ

# loginButtonText
source: Login
ur: لاگ ان کریں

# dontHaveAccount
source: Don't have an account?
ur: کیا آپ کا اکاؤنٹ نہیں ہے؟

source: Sign up
ur: سائن اپ کریں

source: Welcome
ur: خوش آمدید BYTE میں!

# verifyIdentity
source: Automatic identity verification which enables you to verify your identity
ur: آپ کی شناخت کی تصدیق کریں: آپ کے جیب میں آپ کا ذاتی غذائی ماہر۔ اپنی صحتمند خود کو حاصل کرنے کا سفر شروع کریں۔

# signUpFree
source: Create an account, It's free
ur: مفت میں اکاؤنٹ بنائیں

source: Confirm Password
ur: پاسورڈ کی تصدیق کریں

# signUpButtonText
source: Sign up
ur: سائن اپ

# alreadyHaveAccount
source: Already have an account?
ur: پہلے سے اکاؤنٹ ہے؟

# healthInfoFormTitle
source: Health Information Form
ur: صحت کی معلومات کا فارم

# ageLabel
source: Age
ur: عمر

# genderLabel
source: Gender
ur: صنف

# weightLabel
source: Weight (kg)
ur: وزن (کلوگرام)

# heightLabel
source: Height (cm)
ur: قد (سینٹی میٹر)

# fieldRequired
source: This field is required
ur: یہ فیلڈ ضروری ہے

# allergiesLabel
source: Allergies
ur: الرجیز

# diseasesLabel
source: Diseases
ur: بیماریاں

# healthGoalsLabel
source: Health Goals
ur: صحت کے مقاصد

source: Login
ur: لاگ ان

# activityLevelLabel
source: Activity Level
ur: سرگرمی کی سطح

# dietaryPreferencesLabel
source: Dietary Preferences
ur: غذائی ترجیحات

# appPurposeLabel
source: Purpose of Using Our App
ur: اپلیکیشن کا مقصد

source: Passwords do not match
ur: پاس ورڈ میل نہیں کھاتے

# submitButtonLabel
source: Submit
ur: جمع کرو

# formSubmitSuccess
source: Form submitted successfully!
ur: فارم کامیابی سے جمع کروایا گیا!

# formSubmitFail
source: Failed to submit form.
ur: فارم جمع کرانے میں ناکام.

source: Male
ur: مرد

source: Female
ur: خاتون

# otherGender
source: Other
ur: دیگر

source: Sedentary
ur: غیر فعال

source: Lightly Active
ur: ہلکے فعال

source: Moderately Active
ur: معتدل فعال

source: Very Active
ur: بہت فعال

source: Extra Active
ur: انتہائی فعال

# allergyNuts
source: Nuts
ur: گری دار میوے

# allergyDairy
source: Dairy
ur: ڈیری

# allergyPollen
source: Pollen
ur: پولن

# allergyNoKnown
source: No known allergies
ur: کوئی معلوم الرجی نہیں

# diseaseDiabetes
source: Diabetes
ur: ذیابیطس

# diseaseHypertension
source: Hypertension
ur: ہائی بلڈ پریشر

# diseaseNone
source: None
ur: کوئی نہیں

# goalWeightLoss
source: Weight loss
ur: وزن کم کرنا

# goalMuscleGain
source: Muscle gain
ur: پٹھوں کی نشوونما

# goalEndurance
source: Better endurance
ur: بہتر برداشت

# dietVegetarian
source: Vegetarian
ur: سبزی خور

# dietVegan
source: Vegan
ur: ویگن

# dietKeto
source: Keto
ur: کیٹو

# dietNone
source: None
ur: کوئی نہیں

# appPurposeFitness
source: Fitness Tracking
ur: فٹنس ٹریکنگ

# appPurposeNutrition
source: Nutrition Planning
ur: غذائیت کی منصوبہ بندی

# appPurposeHealth
source: Health Monitoring
ur: صحت کی نگرانی

source: Other
ur: دیگر

# locationLabel
source: Location
ur: مقام

source: International
ur: بین الاقوامی

source: Pakistan
ur: پاکستان

# otherDiseasesLabel
source: Other Diseases
ur: دیگر بیماریاں

# otherAllergiesLabel
source: Other Allergies
ur: دیگر الرجی

source: Sign in with Google
ur: گوگل کے ذریعے سائن ان کریں

# goToProfileButtonLabel
source: Go to Profile
ur: پروفائل پر جائیں

# formInvalidError
source: The form is incorrect
ur: فارم غلط ہے

source: Prefer not to say
ur: بتانا نہیں چاہتا

# allergySeafood
source: Seafood
ur: سمندری غذا

# allergyLatex
source: Latex
ur: لیٹیکس

# diseaseHeartDisease
source: Heart Disease
ur: دل کی بیماری

# diseaseAsthma
source: Asthma
ur: دمہ

# diseaseThyroidDisorder
source: Thyroid Disorder
ur: تھائیرائڈ کی خرابی

# goalGainWeight
source: Gain Weight
ur: وزن بڑھانا

# goalMaintainWeight
source: Maintain Weight
ur: وزن برقرار رکھنا

# goalImproveMuscleTone
source: Improve Muscle Tone
ur: پٹھوں کی ٹون بہتر بنانا

# goalIncreaseStamina
source: Increase Stamina
ur: استقامت بڑھانا

# goalImproveHealth
source: Improve Health
ur: صحت بہتر بنانا

# dietPescatarian
source: Pescatarian
ur: پیسکیٹیرین

# dietOmnivore
source: Omnivore
ur: سب کچھ کھانے والا

# dietPaleo
source: Paleo
ur: پیلیو

# dietHalal
source: Halal
ur: حلال

# dietKosher
source: Kosher
ur: کوشر

# dietNoPork
source: No Pork
ur: سور کا گوشت نہیں

# dietNoBeef
source: No Beef
ur: بیف نہیں

# dietVegetarianReligious
source: Vegetarian (Religious)
ur: مذہبی سبزی خور

# appPurposeHealthMonitoring
source: Health Monitoring
ur: صحت کی نگرانی

# appPurposeDietPlanning
source: Diet/Nutrition Planning
ur: غذائیت/ڈائیٹ پلاننگ

# appPurposeWeightManagement
source: Weight Management
ur: وزن کا انتظام

# appPurposeConditionManagement
source: Medical Condition Management
ur: طبی حالت کا انتظام

# appPurposeActivityMotivation
source: Physical Activity Motivation
ur: جسمانی سرگرمی کی ترغیب

# appPurposeResearch
source: Research Purposes
ur: تحقیقاتی مقاصد

# allergyGluten
source: Gluten
ur: گلوٹن

# additionalInfo
source: Additional Information
ur: مزید معلومات

source: About Us
ur: ہمارے بارے میں

source: Edit Profile
ur: پروفائل میں ترمیم کریں

# editProfileConfirmation
source: Do you really want to edit the profile?
ur: کیا آپ واقعی پروفائل میں ترمیم کرنا چاہتے ہیں؟

source: Cancel
ur: منسوخ کریں

source: Confirm
ur: تصدیق کریں

source: Allergies
ur: الرجی

source: Diseases
ur: امراض

source: Health Goals
ur: صحت کے مقاصد

source: Dietary Preferences
ur: غذائی ترجیحات

# additionalInfoPrompt
source: Provide any additional information
ur: کوئی اضافی معلومات مہیا کریں

source: Medical Information
ur: طبی معلومات

# noAdditionalInformation
source: No additional information provided
ur: کوئی اضافی معلومات فراہم نہیں کی گئیں

# religiousDietaryLabel
source: Religious Dietary Restrictions
ur: مذہبی غذائی پابندیاں

# medicalInformationLabel
source: Medical Information
ur: طبی معلومات

# religiousDietaryRestrictionsLabel
source: Religious Dietary Restrictions
ur: مذہبی غذائی پابندیاں

# profileTitle
source: Profile
ur: پروفائل

# greetings
source: Hey, {username}!
ur: سلام،

# settingsButtonLabel
source: Settings
ur: ترتیبات

# languageLabel
source: Language
ur: زبان

# exploreTitle
source: EXPLORE
ur: دریافت کریں

# scanButton
source: Scan
ur: سکین

# chatButton
source: Chat
ur: چیٹ

# communityButton
source: Community
ur: کمیونٹی

# savedItemsTitle
source: Saved Items
ur: محفوظ شدہ اشیاء

# documentsLabel
source: Documents
ur: دستاویزات

# noDocumentsMessage
source: No documents available.
ur: کوئی دستاویزات دستیاب نہیں ہیں۔

source: Settings
ur: ترتیبات

source: Personalization
ur: ذاتی بنانے

source: System
ur: نظام

source: Logout
ur: لاگ آوٹ

source: Feedback
ur: آراء

# rateExperience
source: Rate your experience
ur: اپنے تجربے کا درجہ دیں

# writeReview
source: Write your review
ur: اپنی رائے لکھیں

source: Submit
ur: جمع کرائیں
